abseil-cpp
acl
adobe-source-code-pro-fonts
adwaita-cursors
adwaita-icon-theme
aic94xx-firmware
alsa-card-profiles
alsa-lib
alsa-topology-conf
alsa-ucm-conf
aom
appstream-glib
archlinux-keyring
argon2
ark
asar
at-spi2-core
atkmm
attica
attr
audit
autoconf
automake
avahi
ayatana-ido
base
bash
bcg729
bind
binutils
bison
blueberry
bluetuith-bin
bluez
bluez-libs
bluez-tools
bluez-utils
boost-libs
bridge-utils
brightnessctl
brotli
btop
btrfs-progs
bubblewrap
burpsuite
bzip2
c-ares
ca-certificates
ca-certificates-mozilla
ca-certificates-utils
cairo
cairomm
cantarell-fonts
capstone
catppuccin-cursors-mocha
catppuccin-gtk-theme-mocha
catppuccin-mocha-grub-theme-git
cava
cdparanoia
chezmoi
chrono-date
cmake
colord
containerd
coreutils
cracklib
cronie
cryptsetup
curl
cython
dav1d
db5.3
dbus
dbus-glib
dbus-python
dconf
debtap
debugedit
default-cursors
desktop-file-utils
device-mapper
diffutils
discord
djvulibre
dkms
dmidecode
dmraid
dnssec-anchors
docbook-xml
docbook-xsl
docker
docker-compose
dosfstools
double-conversion
duktape
dunst
e2fsprogs
editorconfig-core-c
efibootmgr
efivar
egl-wayland
eglexternalplatform
electron24-bin
enchant
exiv2
exo
expat
fakeroot
ffcall
ffmpeg
ffmpegthumbnailer
fftw
ffuf
file
filesystem
findutils
firefox
flac
flex
fmt
fontconfig
freeglut
freetype2
fribidi
fuse-common
fuse2
fuse3
galculator
gawk
gc
gcc
gcc-libs
gcr
gcr-4
gd
gdb
gdb-common
gdbm
gdk-pixbuf2
geoclue
gettext
ghostscript
giflib
git
glib-networking
glib2
glibc
glibmm
glibmm-2.68
glslang
glu
gmp
gnome-bluetooth
gnome-desktop-4
gnome-desktop-common
gnome-keyring
gnu-free-fonts
gnupg
gnutls
go
gobject-introspection
gobject-introspection-runtime
gparted
gperftools
gpgme
gpm
gptfdisk
graphene
graphite
grep
grim
grimblast-git
groff
gsettings-desktop-schemas
gsfonts
gsm
gspell
gssdp
gst-plugin-pipewire
gst-plugins-bad-libs
gst-plugins-base
gst-plugins-base-libs
gstreamer
gtk-layer-shell
gtk-update-icon-cache
gtk2
gtk3
gtk4
gtkmm3
gucharmap
guile
gupnp
gupnp-igd
gvfs
gzip
harfbuzz
harfbuzz-icu
hashcat
hdparm
hicolor-icon-theme
hidapi
highway
htop
http-parser
hunspell
hwdata
hwloc
hyphen
hyprland-nvidia-git
hyprpaper-git
hyprpicker-git
iana-etc
icu
ijs
imagemagick
imath
iniparser
intel-ucode
intltool
iproute2
iptables
iputils
iso-codes
itstool
iw
jansson
jasper
java-environment-common
java-openjfx
java-runtime-common
jbig2dec
jdk-openjdk
jemalloc
jq
jre-openjdk
jre-openjdk-headless
json-c
json-glib
jsoncpp
kactivities
karchive
kate
kauth
kbd
kbookmarks
kcmutils
kcodecs
kcompletion
kconfig
kconfigwidgets
kcoreaddons
kcrash
kdbusaddons
kde-cli-tools
kdeclarative
kded
kdesu
keyutils
kglobalaccel
kguiaddons
ki18n
kiconthemes
kio
kitemmodels
kitemviews
kitty
kitty-shell-integration
kitty-terminfo
kjobwidgets
kmod
knewstuff
knotifications
kolourpaint
kpackage
kparts
kpty
krb5
ksanecore
kservice
ktexteditor
ktextwidgets
kuserfeedback
kwallet
kwidgetsaddons
kwindowsystem
kxmlgui
l-smash
lame
lcms2
ldns
less
lhasa
lib32-acl
lib32-brotli
lib32-bzip2
lib32-dbus
lib32-e2fsprogs
lib32-expat
lib32-fontconfig
lib32-freetype2
lib32-gcc-libs
lib32-gettext
lib32-glib2
lib32-glibc
lib32-harfbuzz
lib32-keyutils
lib32-krb5
lib32-libcap
lib32-libffi
lib32-libgcrypt
lib32-libgpg-error
lib32-libldap
lib32-libnl
lib32-libpcap
lib32-libpng
lib32-libtirpc
lib32-libx11
lib32-libxau
lib32-libxcb
lib32-libxcrypt
lib32-libxcursor
lib32-libxdmcp
lib32-libxext
lib32-libxfixes
lib32-libxi
lib32-libxrandr
lib32-libxrender
lib32-openssl
lib32-pam
lib32-pcre2
lib32-systemd
lib32-util-linux
lib32-xz
lib32-zlib
lib32-zstd
libadwaita
libaio
libappindicator-gtk3
libarchive
libass
libassuan
libasyncns
libatasmart
libavc1394
libavif
libax25
libayatana-appindicator
libayatana-indicator
libb2
libblockdev
libbluray
libbpf
libbs2b
libbsd
libbytesize
libcamera
libcamera-ipa
libcanberra
libcap
libcap-ng
libcdio
libcdio-paranoia
libcloudproviders
libcolord
libcups
libdaemon
libdatrie
libdbusmenu-glib
libdbusmenu-gtk3
libdbusmenu-qt5
libde265
libdispatch
libdisplay-info
libdrm
libedit
libelf
libepoxy
libevdev
libevent
libexif
libfdk-aac
libffi
libfontenc
libfreeaptx
libgcrypt
libgirepository
libgit2
libglvnd
libgnomekbd
libgpg-error
libgphoto2
libgtop
libgudev
libgusb
libgxps
libhandy
libheif
libical
libice
libidn
libidn2
libiec61883
libieee1284
libimagequant
libimobiledevice
libindicator-gtk3
libinih
libinput
{%@@ if is_notebook @@%}
libinput-gestures
{%@@ endif @@%}
libirecovery
libisl
libjpeg-turbo
libjxl
libksane
libksba
liblc3
libldac
libldap
liblqr
libluv
liblzf
libmanette
libmaxminddb
libmd
libmfx
libmm-glib
libmng
libmnl
libmodplug
libmpc
libmpdclient
libmysofa
libndp
libnet
libnetfilter_conntrack
libnewt
libnfnetlink
libnftnl
libnghttp2
libnice
libnl
libnm
libnotify
libnsl
libogg
libomxil-bellagio
libopenmpt
libp11-kit
libpaper
libpcap
libpciaccess
libpgm
libpipeline
libpipewire
libplist
libpng
libproxy
libpsl
libpulse
libpwquality
libraqm
libraw1394
librsvg
librsync
libsasl
libseccomp
libsecret
libsigc++
libsigc++-3.0
libsigsegv
libsm
libsndfile
libsodium
libsoup3
libsoxr
libspectre
libssh
libssh2
libstemmer
libsynctex
libsysprof-capture
libtasn1
libteam
libtermkey
libthai
libtheora
libtiff
libtirpc
libtool
libtpms
libtraceevent
libtracefs
libunistring
libunwind
liburcu
libusb
libusbmuxd
libutempter
libuv
libva
libvdpau
libverto
libvorbis
libvpx
libvterm
libwacom
libwebp
libwireplumber
libwpe
libx11
libxau
libxaw
libxcb
libxcomposite
libxcrypt
libxcursor
libxcvt
libxdamage
libxdg-basedir
libxdmcp
libxext
libxfce4ui
libxfce4util
libxfixes
libxfont2
libxft
libxi
libxinerama
libxkbcommon
libxkbcommon-x11
libxkbfile
libxklavier
libxml2
libxmu
libxpm
libxrandr
libxrender
libxshmfence
libxslt
libxss
libxt
libxtst
libxv
libxxf86vm
libyaml
libyuv
libzip
licenses
lilv
linux-api-headers
linux-firmware
linux-firmware-qlogic
linux-firmware-whence
linux-zen
linux-zen-headers
llvm-libs
lm_sensors
lmdb
lsof
lua
lua52
lua53
luajit
lv2
lvm2
lxappearance
lz4
lzo
m4
mailcap
make
mallard-ducktype
man-db
mbedtls
md4c
mdadm
media-player-info
mesa
meson
minizip
mkinitcpio
mkinitcpio-busybox
mobile-broadband-provider-info
mpfr
mpg123
msgpack-c
mtdev
ncurses
ndctl
neofetch
neovim
net-snmp
net-tools
nettle
networkmanager
ninja
nmap
node-gyp
nodejs-lts-hydrogen
nodejs-nopt
noise-suppression-for-voice
notion-app-enhanced
noto-fonts
npm
npth
nspr
nss
ntfs-3g
nvidia-dkms
nvidia-utils
obs-studio
ocl-icd
oniguruma
openal
openasar-git
opencl-nvidia
opencore-amr
openexr
openjpeg2
openmpi
openpmix
openssh
openssl
openssl-1.1
openvpn
opus
orc
otf-cascadia-code-nerd
p11-kit
pacman
pacman-mirrorlist
pahole
pam
pambase
pamixer
pango
pangomm
parted
patch
pavucontrol
pciutils
pcre
pcre2
pcsclite
perl
perl-clone
perl-encode-locale
perl-error
perl-file-listing
perl-html-parser
perl-html-tagset
perl-http-cookies
perl-http-daemon
perl-http-date
perl-http-message
perl-http-negotiate
perl-io-html
perl-libwww
perl-lwp-mediatypes
perl-mailtools
perl-net-http
perl-timedate
perl-try-tiny
perl-uri
perl-www-robotrules
perl-xml-parser
php
pinentry
pipewire
pipewire-alsa
pipewire-audio
pipewire-jack
pipewire-pulse
pixman
pkcs11-helper
pkgconf
pkgfile
playerctl
pnpm
polkit
polkit-kde-agent
polkit-qt5
poppler
poppler-data
poppler-glib
popt
portaudio
potrace
procps-ng
protobuf
psmisc
python
python-attrs
python-autocommand
python-beautifulsoup4
python-cffi
python-chardet
python-configobj
python-cryptography
python-fastjsonschema
python-filelock
python-gobject
python-idna
python-inflect
python-jaraco.context
python-jaraco.functools
python-jaraco.text
python-lxml
python-mako
python-markdown
python-markupsafe
python-more-itertools
python-ordered-set
python-packaging
python-pillow
python-pip
python-platformdirs
python-ply
python-psutil
python-pycparser
python-pydantic
python-pyparsing
python-requests
python-requests-file
python-setproctitle
python-setuptools
python-six
python-soupsieve
python-tldextract
python-tomli
python-trove-classifiers
python-typing_extensions
python-urllib3
python-validate-pyproject
python-wheel
qca-qt5
qt5-base
qt5-declarative
qt5-multimedia
qt5-speech
qt5-svg
qt5-tools
qt5-translations
qt5-wayland
qt5-x11extras
qt5-xmlpatterns
qt5ct
qt6-5compat
qt6-base
qt6-declarative
qt6-imageformats
qt6-svg
qt6-translations
qt6-wayland
ranger
rav1e
re2
readline
reflector
rhash
ripgrep
rnnoise
rofi
rofi-emoji
rsync
rtkit
run-parts
runc
rustscan
rustup
sane
sbc
scdoc
sdl12-compat
sdl2
seahorse
seatd
sed
semver
serd
shadow
shared-mime-info
slang
{%@@ if is_notebook @@%}
slimbookbattery
{%@@ endif @@%}
slurp
snappy
sndio
solid
sonnet
sord
sound-theme-freedesktop
source-highlight
spandsp
spdlog
speex
speexdsp
sqlite
sqlmap
sratom
srt
starship
startup-notification
stress
sudo
svt-av1
swaylock-effects
syndication
syntax-highlighting
sysfsutils
systemd
systemd-libs
systemd-sysvcompat
t1lib
tar
tcpdump
tdb
telegram-desktop
texinfo
texlive-bin
thin-provisioning-tools
thunar
tinycompress
tlp
tlp-rdw
tpm2-tss
tracker3
trash-cli
tree-sitter
tslib
ttf-apple-emoji
ttf-droid
ttf-ibm-plex
ttf-opensans
tumbler
tzdata
uasm
udisks2
unibilium
unzip
up
upd72020x-fw
upower
usbmuxd
usbutils
util-linux
util-linux-libs
v4l-utils
vid.stab
viewnior
vim
vim-runtime
virtualbox
virtualbox-host-dkms
visual-studio-code-bin
vmaf
volume_key
vte-common
vte3
vulkan-headers
vulkan-icd-loader
vulkan-validation-layers
waybar-hyprland-git
wayland
wayland-protocols
wd719x-firmware
webapp-manager
webcord
webkit2gtk-4.1
webrtc-audio-processing
wev
wezterm
wezterm-shell-integration
wezterm-terminfo
wf-recorder
wget
which
wine
wireplumber
wireshark-cli
wireshark-qt
wl-clipboard
wlogout
wlsunset
wmctrl
woff2
wofi
wpa_supplicant
wpebackend-fdo
wtype
x264
x265
xapp
xcb-proto
xcb-util
xcb-util-cursor
xcb-util-errors
xcb-util-image
xcb-util-keysyms
xcb-util-renderutil
xcb-util-wm
xcb-util-xrm
xcur2png
xdg-dbus-proxy
xdg-desktop-portal
xdg-desktop-portal-hyprland-git
xdg-utils
xdotool
xf86-input-libinput
xfconf
xfsprogs
xkeyboard-config
xorg-bdftopcf
xorg-font-util
xorg-fonts-encodings
xorg-mkfontscale
xorg-server
xorg-server-common
xorg-setxkbmap
xorg-xdpyinfo
xorg-xhost
xorg-xinput
xorg-xkbcomp
xorg-xkill
xorg-xprop
xorg-xrandr
xorg-xset
xorg-xwayland
xorgproto
xtrans
xvidcore
xxhash
xz
yay
yelp-tools
yelp-xsl
zeromq
zimg
zip
zlib
zram-generator
zsh
zstd
zziplib
